S6_dOpt/dOpt_Assignment_1.tex
% Created 2018-02-27 ti 14:43
\documentclass[margin=0.3in]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{color}
\usepackage{listings}
\author{Christian Zhuang-Qing Nielsen\thanks{201504624, christian@czn.dk}}
\date{\today}
\title{dOpt 2018: Reassignment 1}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.3.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{A description of your model. Describe the meaning of variables  and constraints.}
\label{sec-1}
The point of this exercise is to find the optimal diet (i.e. cheapest) that still satifies a number of given constraints.

Here each food is a variable in the linear program, which means that the final solution consists of a linear combination of these variables (which in this case is amount of 100g of the given foodstuff). The foods I have chosen and their data can be seen in the tables below.

\subsection{Foods in unit/per 100 Gram.}
\label{sec-1-1}

\begin{center}
\begin{tabular}{lrrrrrr}
\hline
\textbf{Food} & \textbf{Carbs} & \textbf{Protein} & \textbf{Sugar} & \textbf{Fat} & \textbf{Energy (in KJ)} & \textbf{Price in DKK}\\
\hline
Potatoes & 17 & 2 & 0.8 & 0.1 & 318 & 1\\
\hline
Ground beef (8-12\%) & 0 & 19.7 & 0 & 9.7 & 687 & 5.4\\
\hline
Broccoli & 7 & 2.8 & 1.7 & 0.4 & 138.07 & 2.4\\
\hline
Oats (rough) & 58.1 & 13.2 & 1 & 6.5 & 1532 & 1.2\\
\hline
Skimmed Milk & 4.7 & 3.5 & 4.7 & 0.1 & 138 & 1\\
\hline
Butter & 0.7 & 0.6 & 0 & 81.5 & 3094 & 9.9\\
\hline
Chicken breast filet & 0.5 & 20 & 0.5 & 1.5 & 400 & 9\\
\hline
Jasmin Rice & 78 & 8 & 0.3 & 1 & 1507 & 1.5\\
\hline
Canned Tomatoes & 3.1 & 1.1 & 3.1 & 0.5 & 88 & 1.234\\
\hline
\end{tabular}
\end{center}

Vitamines and minerals in milligrams

\begin{center}
\begin{tabular}{lrrr}
\hline
\textbf{Food} & \textbf{Vit. B12} & \textbf{Vit. C} & \textbf{Salt}\\
\hline
Potatoes & 0 & 26.4 & 0.6\\
\hline
Ground Beef (8-12\%) & 0.0019 & 0 & 900\\
\hline
Broccoli & 0 & 121 & 8\\
\hline
Oats (rough) & 0 & 0 & 6.7\\
\hline
Skimmed Milk & 0.0048 & 1.3 & 44.3\\
\hline
Butter & 0.0017 & 0 & 361\\
\hline
Chicken breast filet & 0.0034 & 1 & 63\\
\hline
Jasmin Rice & 0 & 0 & 1.8\\
\hline
Canned Tomatoes & 0 & 11.3 & 143\\
\hline
\end{tabular}
\end{center}


The constraints I have chosen in this model are the following:
\begin{enumerate}
\item The energy amount must be above 10000 kilojoules
\item The amount of energy from carbohydrates must be between 45\% and 60\%.
\item Energy from protein must be between 10\% and 20\%
\item Energy from Fat must be between 25\% and 40\%
\item Energy from added sugar must not exceed 10\% of total energy amount.
\item The amount of salt must be between 2.8g and 4.9g a day
\item Must contain more than 2 $\mu$g of Vitamine B12.
\item Must contain more than 75 milligrams of vitamin C.
\end{enumerate}

\subsection{Definitions}
\label{sec-1-2}
To write it all in a table I have defined some constants (to make writing the relation easier. The constants are the following:

\begin{center}
\begin{tabular}{lll}
\hline
\textbf{Definition} &  & \textbf{Expression}\\
\hline
\textbf{Price} & \verb~=~ & 1x$_{\text{1}}$+5.4x$_{\text{2}}$+2.4x$_{\text{3}}$+1.2x$_{\text{4}}$+1x$_{\text{5}}$+9.9x$_{\text{6}}$+9x$_{\text{7}}$+1.5x$_{\text{8}}$+1.234x$_{\text{9}}$\\
\hline
\textbf{Energy} & \verb~=~ & 318x$_{\text{1}}$+687x$_{\text{2}}$+138.07x$_{\text{3}}$+1532x$_{\text{4}}$+138x$_{\text{5}}$+3094x$_{\text{6}}$+400x$_{\text{7}}$+1507x$_{\text{8}}$+88x$_{\text{9}}$\\
\hline
\textbf{Carbohydrates} & \verb~=~ & 17x$_{\text{1}}$+0x$_{\text{2}}$+7x$_{\text{3}}$+58.1x$_{\text{4}}$+4.7x$_{\text{5}}$+0.7x$_{\text{6}}$+0.5x$_{\text{7}}$+78x$_{\text{8}}$+3.1x$_{\text{9}}$\\
\hline
\textbf{Protein} & \verb~=~ & 2x$_{\text{1}}$+19.7x$_{\text{2}}$+2.8x$_{\text{3}}$+13.2x$_{\text{4}}$+3.5x$_{\text{5}}$+0.6x$_{\text{6}}$+20x$_{\text{7}}$+8x$_{\text{8}}$+1.1x$_{\text{9}}$\\
\hline
\textbf{Fat} & \verb~=~ & 0.1x$_{\text{1}}$+9.7x$_{\text{2}}$+0.4x$_{\text{3}}$+6.5x$_{\text{4}}$+0.1x$_{\text{5}}$+81.5x$_{\text{6}}$+1.5x$_{\text{7}}$+1x$_{\text{8}}$+0.5x$_{\text{9}}$\\
\hline
\textbf{Sugar} & \verb~=~ & 0.8x$_{\text{1}}$+0x$_{\text{2}}$+1.7x$_{\text{3}}$+1x$_{\text{4}}$+4.7x$_{\text{5}}$+0x$_{\text{6}}$+0.5x$_{\text{7}}$+0.3x$_{\text{8}}$+3.1x$_{\text{9}}$\\
\hline
\textbf{Vit.B12} & \verb~=~ & 0x$_{\text{1}}$+0.0019x$_{\text{2}}$+0x$_{\text{3}}$+0x$_{\text{4}}$+0.0048x$_{\text{5}}$+0.0017x$_{\text{6}}$+0.0034x$_{\text{7}}$+0x$_{\text{8}}$+0x$_{\text{9}}$\\
\hline
\textbf{Vit.C} & \verb~=~ & 26.4x$_{\text{1}}$+0x$_{\text{2}}$+121x$_{\text{3}}$+0x$_{\text{4}}$+1.3x$_{\text{5}}$+0x$_{\text{6}}$+1x$_{\text{7}}$+0x$_{\text{8}}$+11.3x$_{\text{9}}$\\
\hline
\textbf{Salt} & \verb~=~ & 0.6x$_{\text{1}}$+900x$_{\text{2}}$+8x$_{\text{3}}$+6.7x$_{\text{4}}$+44.3x$_{\text{5}}$+361x$_{\text{6}}$+63x$_{\text{7}}$+1.8x$_{\text{8}}$+143x$_{\text{9}}$\\
\hline
\end{tabular}
\end{center}

To make keep it simpler from this point afterwards, I introduce some new variables for the macronutrients multiplied by the amount of energy per gram for that nutrient:

\begin{center}
\begin{tabular}{lll}
\hline
\textbf{Definition} &  & \textbf{Expression}\\
\hline
ECarb & \verb~=~ & Carbohydrates $\cdot$ 17\\
\hline
EProtein & \verb~=~ & Protein $\cdot$ 17\\
\hline
EFat & \verb~=~ & Fat $\cdot$ 17\\
\hline
ESugar & \verb~=~ & Sugar $\cdot$ 17\\
\hline
\end{tabular}
\end{center}

\subsection{Constraints}
\label{sec-1-3}
For every macronutrient, it is necessary to rewrite it so that each constraint are on standard form. Furthermore, for constraints that are dependant on other variables (like how the macronutrient bounds are dependant on the amount of total energy) we also have to do some rewrite magic. Lets take Carbohydrates lower bound as an example:


$$ ECarb \geq 0.45*Energy \Leftrightarrow 0.45 \cdot Energy-ECarb \leq 0 $$


This allows us to have 0 in the RHS of the constraint. I do this for every constraint, as seen in the table below:

\begin{center}
\begin{tabular}{l|l}
\textbf{Constraints} & \textbf{Rewritten (for standard form)}\\
\hline
Energy $\ge$ 10000 Kj & -Energy $\le$ -10000 Kj\\
\hline
Carbohydrates $\cdot$ 17 $\ge$ 0.45*Energy & 0.45 $\cdot$ Energy - ECarb $\le$ 0\\
\hline
Carbohydrates $\cdot$ 17 $\le$ 0.6*Energy & -0.6 $\cdot$ Energy + ECarb $\le$ 0\\
\hline
Protein $\cdot$ 17 $\ge$ 0.1*Energy & 0.1 $\cdot$ Energy - EProtein $\le$ 0\\
\hline
Protein $\cdot$ 17 $\le$ 0.2*Energy & -0.2 $\cdot$ Energy + EProtein $\le$ 0\\
\hline
Fat $\cdot$ 38 $\ge$ 0.25*Energy & 0.25 $\cdot$ Energy - EFat $\le$ 0\\
\hline
Fat $\cdot$ 38 $\le$ 0.4*Energy & -0.4 $\cdot$ Energy + EFat $\le$ 0\\
\hline
Sugar $\cdot$ 17 $\le$ 0.1*Energy & -0.1 $\cdot$ Energy + Esugar $\le$ 0\\
\hline
Salt $\ge$ 2800 mg & -Salt $\le$ -2800 mg\\
\hline
Salt $\le$ 4900 mg & No need to rewrite\\
\hline
Vit.B12 $\ge$ 0.002 mg & -Vit.B12 $\le$ -0.002 mg\\
\hline
Vit.C $\ge$ 75 mg & -Vit.C $\le$ -75 mg\\
\hline
\end{tabular}
\end{center}

\section{A short explanation of how you arrived at your model}
\label{sec-2}
I started using only macronutrients and energy as restrictions for my model, but the optimal solution turned out to consist of nothing but oats and butter. This was in my opinion not sustainable, so I added some additional constraints which were the amount of sugar, salt and vitamine-B12 and -C. This improved my results to a point where I consider it eddible (though still a bit bland). The biggest issue I had was the nutritional value of oats as it contained most vitamins and minerals while still being nutritional rich as well as very cheap. I tried including Calcium and potassium to improve the odds of having milk in the final solution, but as it turned out the oats had a higher concentrationo of those minerals as well, thus proving milk obsolete, so I decided not to include them.

\section{An optimal solution found using scipy.optimize.linprog}
\label{sec-3}
I will attach the code as a zipfile/py file. It can also be seen in the sections below.

\subsection{The code:}
\label{sec-3-1}
\lstset{language=Python,label=simplex,caption= ,numbers=none}
\begin{lstlisting}
import scipy.optimize

# Expression coefficients
Energy = [318, 687, 138.07, 1532, 138, 3094, 400, 1507, 88]
Carb = [17, 0, 7, 58.1, 4.7, 0.7, 0.5, 78, 3.1]
Protein = [2, 19.7, 2.8, 13.2, 3.5, 0.6, 20, 8, 1.1]
Fat = [0.1, 9.7, 0.4, 6.5, 0.1, 81.5, 1.5, 1, 0.5]
Sugar = [0.8, 0, 1.7, 1, 4.7, 0, 0.5, 0.3, 3.1]
Vit_B12 = [0, 0.0019, 0, 0, 0.0048, 0.0017, 0.0034, 0, 0]
Vit_C = [26.4, 0, 121, 0, 1.3, 0, 1, 0, 11.3]
Salt = [0.6, 900, 8, 6.7, 44.3, 361, 63, 1.8, 143]



# Coefficients with energy
Minus_Energy = [-1*x for x in Energy]
Ecarb = [17*x for x in Carb]
EProtein = [17*x for x in Protein]
EFat = [38*x for x in Fat]
ESugar = [17*x for x in Sugar]

# Constraints
Carb_Lower = [0.45*x-y for x, y in zip(Energy, Ecarb)]
Carb_Upper = [-0.6*x+y for x, y in zip(Energy, Ecarb)]
Protein_Lower = [0.1*x-y for x, y in zip(Energy, EProtein)]
Protein_Upper = [-0.2*x+y for x, y in zip(Energy, EProtein)]
Fat_Lower = [0.25*x-y for x, y in zip(Energy, EFat)]
Fat_Upper = [-0.4*x+y for x, y in zip(Energy, EFat)]
Sugar_Upper = [-0.1*x+y for x, y in zip(Energy, ESugar)]
c = [1, 5.4, 2.4, 1.2, 1, 9.9, 9, 1.5, 1.234]
A = [Minus_Energy,
     Carb_Lower,
     Carb_Upper,
     Protein_Lower,
     Protein_Upper,
     Fat_Lower,
     Fat_Upper,
     Sugar_Upper,
     [-1*x for x in Salt],
     Salt,
     [-1 * x for x in Vit_B12],
     [-1 * x for x in Vit_C]]

b = [-10000, 0, 0, 0, 0, 0, 0, 0, -2800, 4900, -0.002, -75]

print(scipy.optimize.linprog(c, A, b, options={'tol': 1e-9}))
\end{lstlisting}
The list comprehensions is due to the fact that non-numpy arrays cannot be multiplied by a scalar (in this case -1). I had to set the tolerance to a higher number, as algorithm wouldn't be able to find a feasable solution otherwise.

\subsection{The output:}
\label{sec-3-2}
\begin{verbatim}
    fun: 25.522116983036547
message: 'Optimization terminated successfully.'
    nit: 16
  slack: array([0.00000000e+00, 6.96330607e+02, 0.00000000e+00, 1.00000000e+03,
      0.00000000e+00, 0.00000000e+00, 6.80905411e+02, 2.10000000e+03,
      0.00000000e+00, 0.00000000e+00, 2.62708200e-03, 0.00000000e+00])
 status: 0
success: True
      x: array([0.        , 2.34439788, 0.2161664 , 5.00314242, 0.        ,
      0.10160355, 0.        , 0.        , 4.32246602])
\end{verbatim}

This is the optimal solution for the restraints. According to this solution, each day I will have to eat:
\begin{itemize}
\item 234 grams of ground beef.
\item 22 grams of broccoli.
\item 500 grams of oats.
\item 10 grams of butter.
\item 432 grams of canned tomatoes.
\end{itemize}

To optimize my diet. I deem this solution doable (basically italian food with some extra oats).
% Emacs 25.3.1 (Org mode 8.2.10)
\end{document}